terjeio/grblHAL/drivers/ESP32/driver.c
#ifdef IOEXPAND_ENABLE // TODO: read from expander?
	state.on = iopins.spindle_on;
	state.ccw = hal.driver_cap.spindle_dir && iopins.spindle_dir;
#else
//    state.on = gpio_get_level(SPINDLE_ENABLE_PIN) != 0;
//    state.ccw = hal.driver_cap.spindle_dir && gpio_get_level(SPINDLE_DIRECTION_PIN) != 0;
#endif
    state.value ^= settings.spindle.invert.mask;
    state.on |= pwmEnabled;

#ifdef PWM_RAMPED
    state.at_speed = ledc_get_duty(ledConfig.speed_mode, ledConfig.channel) == pwm_ramp.pwm_target;
#endif
    return state;
}

// end spindle code

// Start/stop coolant (and mist if enabled)
static void coolantSetState (coolant_state_t mode)
{
    mode.value ^= settings.coolant_invert.mask;
#ifdef IOEXPAND_ENABLE
	iopins.flood_on = mode.flood;
	iopins.mist_on = mode.mist;
	ioexpand_out(iopins);
#else
//    gpio_set_level(COOLANT_FLOOD_PIN, mode.flood ? 1 : 0);
//    gpio_set_level(COOLANT_MIST_PIN, mode.mist ? 1 : 0);
#endif
}

// Returns coolant state in a coolant_state_t variable
static coolant_state_t coolantGetState (void)
{
    coolant_state_t state = {0};

#ifdef IOEXPAND_ENABLE // TODO: read from expander?
	state.flood = iopins.flood_on;
	state.mist = iopins.mist_on;
#else
//    state.flood = gpio_get_level(COOLANT_FLOOD_PIN);
//    state.mist  = gpio_get_level(COOLANT_MIST_PIN);
#endif

    state.value ^= settings.coolant_invert.mask;

    return state;
}

static void showMessage (const char *msg)
{
    hal.stream_write("[MSG:");
    hal.stream_write(msg);
    hal.stream_write("]\r\n");
}

// Helper functions for setting/clearing/inverting individual bits atomically (uninterruptable)
IRAM_ATTR static void bitsSetAtomic (volatile uint_fast16_t *ptr, uint_fast16_t bits)
{
	portENTER_CRITICAL(&mux);
    *ptr |= bits;
    portEXIT_CRITICAL(&mux);
}

IRAM_ATTR static uint_fast16_t bitsClearAtomic (volatile uint_fast16_t *ptr, uint_fast16_t bits)
{
	portENTER_CRITICAL(&mux);
    uint_fast16_t prev = *ptr;
    *ptr &= ~bits;
    portEXIT_CRITICAL(&mux);
    return prev;
}

IRAM_ATTR static uint_fast16_t valueSetAtomic (volatile uint_fast16_t *ptr, uint_fast16_t value)
{
	portENTER_CRITICAL(&mux);
    uint_fast16_t prev = *ptr;
    *ptr = value;
    portEXIT_CRITICAL(&mux);
    return prev;
}

void debounceTimerCallback (TimerHandle_t xTimer)
{
	  uint8_t grp = 0;

	  uint32_t i = sizeof(inputpin) / sizeof(state_signal_t);
	  do {
	      i--;
	      if(inputpin[i].debounce && inputpin[i].active) {
	    	  inputpin[i].active = false; //gpio_get_level(inputpin[i].pin) == (inputpin[i].invert ? 0 : 1);
	    	  grp |= inputpin[i].group;
	      }
	  } while(i);

//	  printf("Debounce %d %d\n", grp, systemGetState().value);

	  if(grp & INPUT_GROUP_LIMIT)
		    hal.limit_interrupt_callback(limitsGetState());

	  if(grp & INPUT_GROUP_CONTROL)
		  hal.control_interrupt_callback(systemGetState());
}

#ifdef I2C_PORT

#define WRITE_BIT I2C_MASTER_WRITE              /*!< I2C master write */
#define READ_BIT I2C_MASTER_READ                /*!< I2C master read */
#define ACK_CHECK_EN 0x1                        /*!< I2C master will check ack from slave*/
#define ACK_CHECK_DIS 0x0                       /*!< I2C master will not check ack from slave */
#define ACK_VAL 0x0                             /*!< I2C ack value */
#define NACK_VAL 0x1                            /*!< I2C nack value */

void I2CTask (void *pvParameters)
{
	uint8_t action;

	while(xQueueReceive((QueueHandle_t)pvParameters, &action, portMAX_DELAY) == pdPASS) {
#ifdef KEYPAD_ENABLE
		if(action == 1) { // Read keypad character and add to input buffer
		    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
		    i2c_master_start(cmd);
		    i2c_master_write_byte(cmd, (KEYPAD_I2CADDR << 1) | READ_BIT, ACK_CHECK_EN);
		    i2c_master_read_byte(cmd, &action, NACK_VAL);
		    i2c_master_stop(cmd);
		    if(i2c_master_cmd_begin(I2C_PORT, cmd, 1000 / portTICK_RATE_MS) == ESP_OK)
		    	keypad_enqueue_keycode(action);
		    i2c_cmd_link_delete(cmd);
		}
#endif
	}
}

void i2c_init (void)
{
	static bool init_ok = false;

	if(!init_ok) {

		init_ok = true;

		i2c_config_t i2c_config = {
			.mode = I2C_MODE_MASTER,
			.sda_io_num = I2C_SDA,
			.scl_io_num = I2C_SCL,
			.sda_pullup_en = GPIO_PULLUP_ENABLE,
			.scl_pullup_en = GPIO_PULLUP_ENABLE,
			.master.clk_speed = I2C_CLOCK
		};

		i2c_param_config(I2C_PORT, &i2c_config);
		i2c_driver_install(I2C_PORT, i2c_config.mode, 0, 0, 0);

		i2cQueue = xQueueCreate(5, sizeof(uint8_t));

		TaskHandle_t I2CTaskHandle;

		xTaskCreatePinnedToCore(I2CTask, "I2C", 2048, (void *)i2cQueue, configMAX_PRIORITIES, &I2CTaskHandle, 1);
	}
}

#endif

// Configures perhipherals when settings are initialized or changed
static void settings_changed (settings_t *settings)
{
	uint32_t pwm_max_value = (1UL << ledTimerConfig.duty_resolution) - 1;

    spindle_pwm.period = (uint32_t)(80000000UL / settings->spindle.pwm_freq);
    spindle_pwm.off_value = (uint32_t)(pwm_max_value * settings->spindle.pwm_off_value / 100.0f);
    spindle_pwm.min_value = (uint32_t)(pwm_max_value * settings->spindle.pwm_min_value / 100.0f);
    spindle_pwm.max_value = (uint32_t)(pwm_max_value * settings->spindle.pwm_max_value / 100.0f);
    spindle_pwm.pwm_gradient = (float)(spindle_pwm.max_value - spindle_pwm.min_value) / (settings->spindle.rpm_max - settings->spindle.rpm_min);

    hal.spindle_pwm_off = spindle_pwm.off_value;

    ledc_set_freq(ledTimerConfig.speed_mode, ledTimerConfig.timer_num, (uint32_t)settings->spindle.pwm_freq);

    if(IOInitDone) {

    	// Validate stream setting, switch to serial if not supported
    	if((settings->stream == StreamSetting_WiFi && !hal.driver_cap.wifi) ||
        	(settings->stream == StreamSetting_Bluetooth && !hal.driver_cap.bluetooth))
    		settings->stream = StreamSetting_Serial;

    	// NOTE: some interfaces may defer actual stream switch until stack is operational
    	switch(settings->stream) {

    		case StreamSetting_Serial:
    			selectStream(StreamSetting_Serial);
    			break;

#ifdef WIFI_ENABLE
    		case StreamSetting_WiFi:;
				static bool wifi_ok = false;
				if(!wifi_ok && driver_settings.wifi.ssid[0] != '\0')
					wifi_ok = wifi_init(&driver_settings.wifi);
					// else report error?
				break;
#endif

#ifdef BLUETOOTH_ENABLE
    		case StreamSetting_Bluetooth:;
    			static bool bluetooth_ok = false;
    			if(!bluetooth_ok && driver_settings.bluetooth.device_name[0] != '\0')
					bluetooth_ok = bluetooth_init(&driver_settings.bluetooth);
				// else report error?
#endif
    		default:
    			break;
    	}

