terjeio/grblHAL/drivers/ESP32/driver.c
    gpio_config(&gpioConfig);

   /****************************
    *  Software debounce init  *
    ****************************/

    if(hal.driver_cap.software_debounce)
        debounceTimer = xTimerCreate("msDelay", pdMS_TO_TICKS(32), pdFALSE, NULL, debounceTimerCallback);

    /******************************************
     *  Control, limit & probe pins dir init  *
     ******************************************/

    gpio_isr_register(gpio_isr, NULL, (int)ESP_INTR_FLAG_IRAM, NULL);

#ifdef PWM_RAMPED
    ledc_fade_func_install(ESP_INTR_FLAG_IRAM);
#endif

   /******************
    *  Spindle init  *
    ******************/

    if((hal.driver_cap.variable_spindle)) {
    	ledConfig.speed_mode = ledTimerConfig.speed_mode;
    	ledc_timer_config(&ledTimerConfig);
    	ledc_channel_config(&ledConfig);
    } else
        hal.spindle_set_state = &spindleSetState;

#ifdef SDCARD_ENABLE
    sdcard_init();
#endif

#ifdef IOEXPAND_ENABLE
    ioexpand_init();
#endif

#ifdef KEYPAD_ENABLE
    keypad_init();
#endif

  // Set defaults

    IOInitDone = settings->version == 14;

    settings_changed(settings);

    spindleSetState((spindle_state_t){0}, spindle_pwm.off_value, DEFAULT_SPINDLE_RPM_OVERRIDE);
    coolantSetState((coolant_state_t){0});
    stepperSetDirOutputs((axes_signals_t){0});

    return IOInitDone;
}

static bool driver_setting (uint_fast16_t param, float value, char *svalue)
{
	bool claimed = false;

	if(svalue) switch(param) {

		case 71:
			claimed = strlcpy(driver_settings.wifi.ssid, svalue, sizeof(driver_settings.wifi.ssid)) <= sizeof(driver_settings.wifi.ssid);
			break;

		case 72:
			claimed = strlcpy(driver_settings.wifi.password, svalue, sizeof(driver_settings.wifi.password)) <= sizeof(driver_settings.wifi.password);
			break;

		case 73:
			if((claimed = (value != NAN && value > 0.0f && value < 65536.0f)))
				driver_settings.wifi.port = (uint16_t)value;
			break;

		case 74:
			claimed = strlcpy(driver_settings.bluetooth.device_name, svalue, sizeof(driver_settings.bluetooth.device_name)) <= sizeof(driver_settings.bluetooth.device_name);
			break;

		case 75:
			claimed = strlcpy(driver_settings.bluetooth.service_name, svalue, sizeof(driver_settings.bluetooth.service_name)) <= sizeof(driver_settings.bluetooth.service_name);
			break;
	}

#ifdef KEYPAD_ENABLE
	if(!claimed)
		claimed = keypad_setting(param, value, svalue);
#endif

	if(claimed)
		hal.eeprom.memcpy_to_with_checksum(hal.eeprom.driver_area.address, (uint8_t *)&driver_settings, sizeof(driver_settings));

    return claimed;
}

static void report_string_setting (uint8_t setting, char *value)
{
    hal.stream_write("$");
    hal.stream_write(uitoa((uint32_t)setting));
    hal.stream_write("=");
    hal.stream_write(value);
    hal.stream_write("\r\n");
}

static void driver_settings_report (bool axis_setting, axis_setting_type_t setting_type, uint8_t axis_idx)
{
    if(!axis_setting) {
#ifdef KEYPAD_ENABLE
    	keypad_settings_report(axis_setting, setting_type, axis_idx);
#endif
#ifdef WIFI_ENABLE
		report_string_setting(71, driver_settings.wifi.ssid);
		report_string_setting(72, driver_settings.wifi.password);
		report_uint_setting(73, driver_settings.wifi.port);
#endif
#ifdef BLUETOOTH_ENABLE
		report_string_setting(74, driver_settings.bluetooth.device_name);
		report_string_setting(75, driver_settings.bluetooth.service_name);
#endif
    }
}

void driver_settings_restore (uint8_t restore_flag)
{
    if(restore_flag & SETTINGS_RESTORE_DRIVER_PARAMETERS) {
    	driver_settings.wifi.ssid[0] = '\0';
    	driver_settings.wifi.password[0] = '\0';
    	driver_settings.wifi.port = 23;
    	strcpy(driver_settings.bluetooth.device_name, "GRBL");
    	strcpy(driver_settings.bluetooth.service_name, "GRBL Serial Port");
#ifdef KEYPAD_ENABLE
    	keypad_settings_restore(restore_flag);
#endif
    	hal.eeprom.memcpy_to_with_checksum(hal.eeprom.driver_area.address, (uint8_t *)&driver_settings, sizeof(driver_settings));
    }
}

// Initialize HAL pointers, setup serial comms and enable EEPROM
// NOTE: Grbl is not yet configured (from EEPROM data), driver_setup() will be called when done
bool driver_init (void)
{
    // Enable EEPROM and serial port here for Grbl to be able to configure itself and report any errors

    uartInit();

    hal.info = "ESP32";
    hal.driver_setup = driver_setup;
    hal.f_step_timer = rtc_clk_apb_freq_get() / STEPPER_DRIVER_PRESCALER;
    hal.rx_buffer_size = RX_BUFFER_SIZE;
    hal.delay_ms = driver_delay_ms;
    hal.settings_changed = settings_changed;

    hal.stepper_wake_up = stepperWakeUp;
    hal.stepper_go_idle = stepperGoIdle;
    hal.stepper_enable = stepperEnable;
    hal.stepper_set_outputs = stepperSetStepOutputs;
    hal.stepper_set_directions = stepperSetDirOutputs;
    hal.stepper_cycles_per_tick = stepperCyclesPerTick;
    hal.stepper_pulse_start = stepperPulseStart;

    hal.limits_enable = limitsEnable;
    hal.limits_get_state = limitsGetState;

    hal.coolant_set_state = coolantSetState;
    hal.coolant_get_state = coolantGetState;

    hal.probe_get_state = probeGetState;
    hal.probe_configure_invert_mask = probeConfigure;

    hal.spindle_set_state = spindleSetStateVariable;
    hal.spindle_get_state = spindleGetState;
    hal.spindle_set_speed = spindleSetSpeed;
    hal.spindle_compute_pwm_value = spindleComputePWMValue;

    hal.system_control_get_state = systemGetState;

    selectStream(StreamSetting_Serial);

#ifdef HAS_EEPROM
    eeprom_init();
    hal.eeprom.type = EEPROM_Physical;
    hal.eeprom.get_byte = eepromGetByte;
    hal.eeprom.put_byte = eepromPutByte;
    hal.eeprom.memcpy_to_with_checksum = eepromWriteBlockWithChecksum;
    hal.eeprom.memcpy_from_with_checksum = eepromReadBlockWithChecksum;
#else
    if(nvsInit()) {
        hal.eeprom.type = EEPROM_Emulated;
        hal.eeprom.size = GRBL_NVS_SIZE;
        hal.eeprom.memcpy_from_flash = nvsRead;
        hal.eeprom.memcpy_to_flash = nvsWrite;
		hal.eeprom.driver_area.address = GRBL_EEPROM_SIZE;
		hal.eeprom.driver_area.size = sizeof(driver_settings); // Add assert?
	} else
	    hal.eeprom.type = EEPROM_None;
#endif

    hal.driver_setting = driver_setting;
    hal.driver_settings_report = driver_settings_report;
    hal.driver_settings_restore = driver_settings_restore;

